app/controllers/articles_controller.rb

  def edit
    @article = Article.find(params[:id]) # make helper method under private?
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @article = Article.find(params[:id]) # make helper method under private?
    @article.update(title: params[:article][:title], description: params[:article][:description])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2019-11-26 07:59:44.471883"], ["id", 1]]